Arch-genue/esp8266-cmake-template/src/constants.h
    byte efbright = 0;
    byte efspeed = 0;
    byte efscale = 0;
    
    int16_t length = 16;    // длина ленты
    int16_t width = 16;     // ширина матрицы
    int16_t height = 16;    //? для совместимости

    byte num_leds = this->length * this->width; 

    byte GMT = 16;          // часовой пояс +13
    uint32_t cityID = 1;    // city ID
    bool mqtt = 0;          // mqtt
    char mqttID[32];        //
    char mqttHost[32];      //
    int mqttPort = 0;       //
    char mqttLogin[16];     //
    char mqttPass[16];      //

    byte state = 1;         // состояние 0 выкл, 1 вкл
    byte group = 1;         // группа девайса (1-10)
    byte role = 0;          // 0 slave, 1 master
    byte WiFimode = 0;      // 0 AP, 1 local
    byte presetAmount = 1;  // количество режимов
    byte manualOff = 0;     // выключали вручную?
    int8_t curPreset = 0;   // текущий режим
    char ssid[32];          // логин wifi
    char pass[32];          // пароль wifi
    byte version = GL_VERSION;
    byte update = 0;
};

#define PRES_SIZE 13
#define MAX_PRESETS 40
struct Preset {
    byte effect = 1;        // тип эффекта (1,2...) ВЫЧЕСТЬ 1
    byte fadeBright = 1;    // флаг на свою яркость (0/1)
    byte bright = 100;      // своя яркость (0.. 255)
    byte advMode = 1;       // дополнительно (1,2...) ВЫЧЕСТЬ 1
    byte soundReact = 1;    // реакция на звук (1,2...) ВЫЧЕСТЬ 1
    byte min = 20;           // мин сигнал светомузыки (0.. 255)
    byte max = 255;           // макс сигнал светомузыки (0.. 255)
    byte speed = 200;       // скорость (0.. 255)
    byte palette = 2;       // палитра (1,2...) ВЫЧЕСТЬ 1
    byte scale = 100;       // масштаб (0.. 255)
    byte fromCenter = 1;    // эффект из центра (0/1)
    byte color = 30;         // цвет (0.. 255)
    byte fromPal = 0;       // из палитры (0/1)
};

#define DAWN_SIZE 24
struct Dawn {
    byte state[7] = {0, 0, 0, 0, 0, 0, 0};  // (1/0)
    byte hour[7] = {0, 0, 0, 0, 0, 0, 0};   // (0.. 59)
    byte minute[7] = {0, 0, 0, 0, 0, 0, 0}; // (0.. 59)
    byte bright = 100;      // (0.. 255)
    byte time = 1;          // (5,10,15,20..)
    byte post = 1;          // (5,10,15,20..)
};

#define EE_TOUT 30000       // таймаут сохранения епром после изменения, мс
#define DEBUG_SERIAL_LAMP   // закомментируй чтобы выключить отладку (скорость 115200)
#define EE_KEY 56 

#define PAL_SIZE 49
struct Palette {
    byte size = 1;
    byte strip[16 * 3];
};

extern Config cfg;
extern Preset preset[MAX_PRESETS];
extern Dawn dawn;
extern Palette pal;

#include "timers.h"

extern Time now;

extern uint32_t udpTmr;
extern uint32_t gotADCtmr;
extern bool loading;

extern int udpLength;
extern byte udpScale;
extern byte udpBright;

#define CUR_PRES preset[cfg.curPreset]

#define USE_ADC 1
#define USE_CLAP 0          // два хлопка в ладоши вкл выкл лампу
#define MIC_VCC 12          // питание микрофона GPIO12 (D6 на wemos/node)

#include "volanalyzer.h"

extern VolAnalyzer vol;
extern VolAnalyzer low;
extern VolAnalyzer high;

byte scaleFF(byte x, byte b);

int mapFF(byte x, byte min, byte max);

// // ------------------- МАКРО --------------------
#ifdef DEBUG_SERIAL_LAMP
	#define DEBUGLN(x) Serial.println(x)
	#define DEBUG(x) Serial.print(x)
#else
	#define DEBUGLN(x)
	#define DEBUG(x)
#endif

#define FOR_i(x,y)  for (int i = (x); i < (y); i++)
#define FOR_j(x,y)  for (int j = (x); j < (y); j++)
#define FOR_k(x,y)  for (int k = (x); k < (y); k++)

extern byte btnClicks, brTicks;

extern timerMillis EEtmr;
extern timerMillis turnoffTmr;
extern timerMillis connTmr;
extern timerMillis dawnTmr;
extern timerMillis holdPresTmr;
extern timerMillis blinkTmr;

extern timerMillis effTmr;
extern timerMillis onlineTmr;
extern timerMillis postDawn;
extern TimeRandom trnd;

extern bool gotNTP;
extern bool gotTime;

void presetRotation(bool force);
void changePreset(int dir);
void setPreset(byte pres);
void controlHandler(bool state);
void fade(bool state);
void fadeDown(uint32_t time);

extern bool loadingFlag;

#include <FastLED.h>
/**
 * Стандартный класс для создания эффектов
 * Функция setup() содержит инициализацию эффекта
 * Функция start() запускает эффект
 * Функция update() обновляет эффект
 */
class Effect {
public:
    uint8_t _bright;
    uint8_t _speed;
    uint8_t _scale;
    uint8_t _color;

    void _start() {
        DEBUG("Запущен эффект ");
        DEBUGLN(this->get_name());
        
        // Start эффекта
        this->start();
    }

    virtual void setup() = 0;
    virtual void start() = 0;
    virtual void update() = 0;

    void set_name(const char* name) {
        strncpy(_name, name, sizeof(_name)-1);
        _name[sizeof(_name) - 1] = '\0';
    }
    const char* get_name() {
        return _name;
    }
protected:
    char _name[50];
    
    bool _state;
    bool _use_analog;

    // несколько общих переменных и буферов, которые могут использоваться в любом эффекте
    uint8_t _hue, _hue2;                                // постепенный сдвиг оттенка или какой-нибудь другой цикличный счётчик
    uint8_t _deltaHue, _deltaHue2;                      // ещё пара таких же, когда нужно много
    uint8_t _step;                                      // какой-нибудь счётчик кадров или последовательностей операций
    uint8_t _pcnt;                                      // какой-то счётчик какого-то прогресса
    uint8_t _deltaValue;                                // просто повторно используемая переменная
    float _speedfactor;                                 // регулятор скорости в эффектах реального времени
    float _emitterX, _emitterY;                         // какие-то динамичные координаты
    CRGB _ledsbuff[NUM_LEDS];                           // копия массива leds[] целиком
    // #define NUM_LAYERSMAX 2
    uint8_t _noise3d[2][WIDTH][HEIGHT];     // двухслойная маска или хранилище свойств в размер всей матрицы
    uint8_t _line[WIDTH];                               // свойство пикселей в размер строки матрицы
    uint8_t _shiftHue[HEIGHT];                          // свойство пикселей в размер столбца матрицы
    uint8_t _shiftValue[HEIGHT];                        // свойство пикселей в размер столбца матрицы ещё одно
    uint16_t _ff_x, _ff_y, _ff_z;                       // большие счётчики
    // Стандартный таймер для эффектов
    uint32_t _timer;
};

#include <vector>
extern std::vector<Effect*> effectsList;